/* automatically generated file */



mod f16_consts {

    /// Euler’s number (e)
    #[unstable(feature = "f16", issue = "116909")]
    const E: f16 = 2.718281828459045235360287471352662497759;

    /// The Euler-Mascheroni constant (γ)
    #[unstable(feature = "f16", issue = "116909")]
    const EGAMMA: f16 = 0.5772156649015328606065120900824024310432;

    /// 1/π
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_1_PI: f16 = 0.3183098861837906715377675267450287240691;

    /// 1/sqrt(2)
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_1_SQRT_2: f16 = 0.7071067811865474617150084668537601828575;

    /// 1/sqrt(3)
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_1_SQRT_3: f16 = 0.5773502691896258420811705036612693220377;

    /// 1/sqrt(π)
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_1_SQRT_PI: f16 = 0.5641895835477562869480794515607725858438;

    /// 2/π
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_2_PI: f16 = 0.6366197723675813430755350534900574481383;

    /// 2/sqrt(π)
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_2_SQRT_PI: f16 = 1.128379167095512573896158903121545171688;

    /// π/2
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_PI_2: f16 = 1.570796326794896619231321691639751442098;

    /// π/3
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_PI_3: f16 = 1.047197551196597746154214461093167628063;

    /// π/4
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_PI_4: f16 = 0.7853981633974483096156608458198757210488;

    /// π/6
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_PI_6: f16 = 0.5235987755982988730771072305465838140316;

    /// π/8
    #[unstable(feature = "f16", issue = "116909")]
    const FRAC_PI_8: f16 = 0.3926990816987241548078304229099378605244;

    /// ln(10)
    #[unstable(feature = "f16", issue = "116909")]
    const LN_10: f16 = 2.302585092994045901093613792909309267998;

    /// ln(2)
    #[unstable(feature = "f16", issue = "116909")]
    const LN_2: f16 = 0.6931471805599452862267639829951804131269;

    /// log10(2)
    #[unstable(feature = "f16", issue = "116909")]
    const LOG10_2: f16 = 0.3010299956639811980174670225096633657813;

    /// log10(e)
    #[unstable(feature = "f16", issue = "116909")]
    const LOG10_E: f16 = 0.434294481903251827651128918916605082294;

    /// log2(10)
    #[unstable(feature = "f16", issue = "116909")]
    const LOG2_10: f16 = 3.32192809488736218170856773213017731905;

    /// log2(e)
    #[unstable(feature = "f16", issue = "116909")]
    const LOG2_E: f16 = 1.442695040888963407359924681001892137427;

    /// The golden ratio (φ)
    #[unstable(feature = "f16", issue = "116909")]
    const PHI: f16 = 1.61803398874989484820458683436563811772;

    /// Archimedes’ constant (π)
    #[unstable(feature = "f16", issue = "116909")]
    const PI: f16 = 3.141592653589793238462643383279502884195;

    /// sqrt(2)
    #[unstable(feature = "f16", issue = "116909")]
    const SQRT_2: f16 = 1.414213562373095145474621858738828450441;

    /// sqrt(3)
    #[unstable(feature = "f16", issue = "116909")]
    const SQRT_3: f16 = 1.732050807568877193176604123436845839024;

    /// The full circle constant (τ)
    /// 
    /// Equal to 2π
    #[unstable(feature = "f16", issue = "116909")]
    const TAU: f16 = 6.283185307179586476925286766559005768391;

}



mod f128_consts {

    /// Euler’s number (e)
    #[unstable(feature = "f128", issue = "116909")]
    const E: f128 = 2.718281828459045235360287471352662497757247093699959574966967627724076630353555;

    /// The Euler-Mascheroni constant (γ)
    #[unstable(feature = "f128", issue = "116909")]
    const EGAMMA: f128 = 0.5772156649015328606065120900824024310421593359399235988057672348848677267776685;

    /// 1/π
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_1_PI: f128 = 0.3183098861837906715377675267450287240689192914809128974953346881177935952684543;

    /// 1/sqrt(2)
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_1_SQRT_2: f128 = 0.707106781186547461715008466853760182857513427734375;

    /// 1/sqrt(3)
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_1_SQRT_3: f128 = 0.57735026918962584208117050366126932203769683837890625;

    /// 1/sqrt(π)
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_1_SQRT_PI: f128 = 0.5641895835477562869480794515607725858440506293289988568440857217106424684414956;

    /// 2/π
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_2_PI: f128 = 0.6366197723675813430755350534900574481378385829618257949906693762355871905369086;

    /// 2/sqrt(π)
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_2_SQRT_PI: f128 = 1.128379167095512573896158903121545171688101258657997713688171443421284936882991;

    /// π/2
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_PI_2: f128 = 1.570796326794896619231321691639751442098584699687552910487472296153908203143099;

    /// π/3
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_PI_3: f128 = 1.04719755119659774615421446109316762806572313312503527365831486410260546876206;

    /// π/4
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_PI_4: f128 = 0.7853981633974483096156608458198757210492923498437764552437361480769541015715495;

    /// π/6
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_PI_6: f128 = 0.5235987755982988730771072305465838140328615665625176368291574320513027343810301;

    /// π/8
    #[unstable(feature = "f128", issue = "116909")]
    const FRAC_PI_8: f128 = 0.3926990816987241548078304229099378605246461749218882276218680740384770507857748;

    /// ln(10)
    #[unstable(feature = "f128", issue = "116909")]
    const LN_10: f128 = 2.30258509299404590109361379290930926799774169921875;

    /// ln(2)
    #[unstable(feature = "f128", issue = "116909")]
    const LN_2: f128 = 0.69314718055994528622676398299518041312694549560546875;

    /// log10(2)
    #[unstable(feature = "f128", issue = "116909")]
    const LOG10_2: f128 = 0.301029995663981198017467022509663365781307220458984375;

    /// log10(e)
    #[unstable(feature = "f128", issue = "116909")]
    const LOG10_E: f128 = 0.4342944819032518276511289189166050822943970058036665661144537831658646492088731;

    /// log2(10)
    #[unstable(feature = "f128", issue = "116909")]
    const LOG2_10: f128 = 3.321928094887362181708567732130177319049835205078125;

    /// log2(e)
    #[unstable(feature = "f128", issue = "116909")]
    const LOG2_E: f128 = 1.442695040888963407359924681001892137426645954152985934135449406931109219181187;

    /// The golden ratio (φ)
    #[unstable(feature = "f128", issue = "116909")]
    const PHI: f128 = 1.61803398874989484820458683436563811772030917980576286213544862270526046281891;

    /// Archimedes’ constant (π)
    #[unstable(feature = "f128", issue = "116909")]
    const PI: f128 = 3.141592653589793238462643383279502884197169399375105820974944592307816406286198;

    /// sqrt(2)
    #[unstable(feature = "f128", issue = "116909")]
    const SQRT_2: f128 = 1.4142135623730951454746218587388284504413604736328125;

    /// sqrt(3)
    #[unstable(feature = "f128", issue = "116909")]
    const SQRT_3: f128 = 1.732050807568877193176604123436845839023590087890625;

    /// The full circle constant (τ)
    /// 
    /// Equal to 2π
    #[unstable(feature = "f128", issue = "116909")]
    const TAU: f128 = 6.283185307179586476925286766559005768394338798750211641949889184615632812572396;

}
